BuildingSystems.Electrical.getPrimaryModifier(FamilyInstance!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Get primary power connector or first power connector on the given power panel.
panel: Power panel.
Returns: Primary power connector or first power connector on the given power panel.

BuildingSystems.Electrical.getNumberOfPolesByConnectedPhases(ElectricalConnectedPhases.Enum)
Get the number of poles corresponding to the given connected phases.
connectedPhases: Connected phases
Returns: The number of poles corresponding to the given connected phases.

BuildingSystems.Electrical.getUpstreamElecEquipmentIds(FamilyInstance!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Get the upstream electrical equipment ids of the given power panel.
panel: Electrical power panel.
Returns: The upstream electrical equipment ids of the given panel.

BuildingSystems.Electrical.areVoltageMapsTheSame(crs.Map&lt;ElectricalConnectedPhases.Enum,UVUtils.UV,std.less&lt;ElectricalConnectedPhases.Enum&gt;,tnallc&lt;std.pair&lt;ElectricalConnectedPhases.Enum!System.Runtime.CompilerServices.IsConst,UVUtils.UV&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,crs.Map&lt;ElectricalConnectedPhases.Enum,UVUtils.UV,std.less&lt;ElectricalConnectedPhases.Enum&gt;,tnallc&lt;std.pair&lt;ElectricalConnectedPhases.Enum!System.Runtime.CompilerServices.IsConst,UVUtils.UV&gt;&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Whether the given two voltage maps are the same.
voltageMap1: First voltage map.
voltageMap2: Second voltage map.
Returns: True if the first voltage map is the same as the second voltage map.

BuildingSystems.Electrical.getDistributionSystemByPanel(FamilyInstance!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
The distribution system on the given panel.
panel: Power panel.
isPrimary: True if getting the distribution system on panel's primary side (only transformers have secondary side).
Returns: Distribution system on the given panel

BuildingSystems.Electrical.getConnectedPhasesOnCircuit(RbsElectricalSystem!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Get the connected phases on the given circuit.
circuit: Electrical circuit.
Returns: Connected phases on the given circuit.